# -*- coding: utf-8 -*-
"""
Задание 7.2a

Сделать копию скрипта задания 7.2.

Дополнить скрипт: Скрипт не должен выводить на стандартрый поток вывода команды,
в которых содержатся слова из списка ignore.

При этом скрипт также не должен выводить строки, которые начинаются на !.

Проверить работу скрипта на конфигурационном файле config_sw1.txt.
Имя файла передается как аргумент скрипту.

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""

ignore = ["duplex", "alias", "configuration"]

name = 'config_sw1.txt'
file = open(name)

for elem in file:
    flag = True
    if elem.count('!'):
        flag = False
    for ign in ignore:
        if ign in elem:
            flag = False
    if flag:
        print(elem, end='')

file.close()
